import Question from "./Question"

function QA() {

    return (

        <div className="py-2 px-4 mt-10">

            <div className="max-w-[1250px] lg:max-w-[1000px] m-auto">

                <h1 className="text-2xl lg:text-center lg:text-4xl mt-3 text-[#050a41] font-bold">Частые вопросы</h1>

                <div className="mt-5 flex flex-col items-center justify-center gap-3">

                    <Question
                        question="Что такое бесплатный открытый урок?" answer="
                    Бесплатный открытый урок - это возможность попробовать наши
                    курсы бесплатно. Вы сможете лично познакомиться с
                    преподавателем, задать ему вопросы и получить представление
                    о формате обучения, методиках преподавания и содержании
                    курсов.
                "/>

                    <Question
                        question="Как записаться на курс?" answer="
                    Записаться на курс у нас очень просто. Вы можете связаться с
                    нами через наш веб-сайт, заполнив форму или заявку на
                    запись. Также вы можете позвонить нам по номеру +90 197 71
                    00 или посетить наш офис лично. Наши менеджеры с
                    удовольствием помогут вам выбрать подходящий курс и
                    заполнить все необходимые документы для записи. Мы готовы
                    ответить на все ваши вопросы и помочь вам начать ваш путь к
                    новым знаниям и навыкам!
                
                "/>



                    <Question
                        question="Кем являются преподаватели?" answer="
                    Бесплатный открытый урок - это возможность попробовать наши
                    курсы бесплатно. Вы сможете лично познакомиться с
                    преподавателем, задать ему вопросы и получить представление
                    о формате обучения, методиках преподавания и содержании
                    курсов.
                "/>

                    <Question
                        question="Я еще учусь в школе. Могу я посещать занятия?" answer="
                    Да, конечно! Мы рады приветствовать студентов всех
                    возрастов. Наш центр предлагает курсы, которые подходят как
                    школьникам, так и взрослым. Важно отметить, что наши
                    профессиональные курсы доступны для студентов от 14 лет и
                    старше, но мы также предлагаем курсы по компьютерной
                    грамотности без возрастных ограничений. Главное - ваш
                    интерес к изучению IT и готовность учиться.
                
                
                "/>

                    <Question
                        question="Смогу ли я совмещать обучение и работу?" answer="
                    Да, мы предлагаем гибкий график занятий, который позволяет
                    вам совмещать обучение с работой. Большинство наших занятий
                    проводятся в удобное для вас время, что облегчает процесс
                    обучения и помогает вам достичь поставленных целей.
                
                "/>

                    <Question
                        question="Я совсем новичок, смогу ли я учиться?" answer="
                    Да. Специальные знания для поступления на курс не требуются.
                    Главное — посещать уроки, выполнять домашние задания и
                    прислушиваться к преподавателю.
                
                "/>

                    <Question
                        question="Как проходит проверка домашних заданий?" answer="
                    Домашние задания проверяются нашими опытными
                    преподавателями, которые обеспечивают качественную обратную
                    связь и поддержку студентам. Мы стремимся обеспечить
                    индивидуальный подход к каждому студенту и помочь им
                    развивать свои навыки и улучшать результаты.
                
                "/>

                    <Question
                        question="На каком языке проходит обучение?" answer="
                    Мы предлагаем обучение как на русском и на узбекском языках
                    в зависимости от того в какую группу вы записались
                
                "/>

                    <Question
                        question="Я пропустил урок, что мне делать?" answer="
                    Если вы пропустили урок, не беспокойтесь, вы всегда можете
                    посмотреть запись урока который отправляется в телеграмм
                    группу сразу после урока. Если у вас возникли вопросы по
                    пропущенному материалу, не стесняйтесь обращаться к
                    преподавателям. Важно не пропускать занятия, чтобы не
                    отставать от общего прогресса группы.
                
                "/>

                    <Question
                        question="Смогу ли я работать после обучения?" answer="
                    Если вы приложите достаточное усилие к обучению сможете
                    легко найти работу. Особенно мы стараемся помочь в
                    трудоустройстве нашим наиболее успешным выпускникам. Для
                    этого крайне важно регулярно посещать занятия и усердно
                    оттачивать навыки в выбранной вами сфере.
                
                
                "/>

                </div>

            </div>

        </div>

    )

}

export default QA